app/controllers/api_controller.rb

	def view
		respond_to do |format|
			@order = Order.find(params[:schedule_id])
			@schedule = Schedule.find(@order.schedule)
---
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
SELECT  "schedules".* FROM "schedules" WHERE "schedules"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]