app/controllers/labour_availabilities_controller.rb

SELECT "labour_availabilities".* FROM "labour_availabilities"
---
  def index
    @labour_availabilities = LabourAvailability.all