app/controllers/raw_material_products_controller.rb

SELECT "raw_material_products".* FROM "raw_material_products"
---
  def index
    @raw_material_products = RawMaterialProduct.all